function smatrix_new = smatrix_rotate (smatrix, A)
  % заготовка для ответа
  smatrix_new = zeros(3,6);

  % матрица обратного поворота
  A_inv = A';

  % заготовка для матрицы A^(T)
  A_T = zeros (6,6);

  A_T(1:3, 1:3) = A_inv.*A_inv;

  % нижняя левая четверть
  A_T(4, 1:3) = A_inv(2, :).*A_inv(3, :);
  A_T(5, 1:3) = A_inv(3, :).*A_inv(1, :);
  A_T(6, 1:3) = A_inv(1, :).*A_inv(2, :);

  % верхняя правая четверть
  A_T(1:3, 4) = 2*A_inv(:, 2).*A_inv(:, 3);
  A_T(1:3, 5) = 2*A_inv(:, 3).*A_inv(:, 1);
  A_T(1:3, 6) = 2*A_inv(:, 1).*A_inv(:, 2);

  % нижняя правая четверть

  A_T(4,4) = A_inv(2,2)*A_inv(3,3) + A_inv(2,3)*A_inv(3,2);
  A_T(4,5) = A_inv(2,3)*A_inv(3,1) + A_inv(2,1)*A_inv(3,3);
  A_T(4,6) = A_inv(2,1)*A_inv(3,2) + A_inv(2,2)*A_inv(3,1);

  A_T(5,4) = A_inv(1,2)*A_inv(3,3) + A_inv(1,3)*A_inv(3,2);
  A_T(5,5) = A_inv(1,3)*A_inv(3,1) + A_inv(1,1)*A_inv(3,3);
  A_T(5,6) = A_inv(1,1)*A_inv(3,2) + A_inv(1,2)*A_inv(3,1);

  A_T(6,4) = A_inv(1,2)*A_inv(2,3) + A_inv(1,3)*A_inv(2,2);
  A_T(6,5) = A_inv(1,3)*A_inv(2,1) + A_inv(1,1)*A_inv(2,3);
  A_T(6,6) = A_inv(1,1)*A_inv(2,2) + A_inv(1,2)*A_inv(2,1);

  % заготовка для матрицы A^(E)
  A_E = zeros (6,6);

  A_E(1:3, 1:3) = A.*A;

  % нижняя левая четверть
  A_E(4, 1:3) = 2*A(2, :).*A(3, :);
  A_E(5, 1:3) = 2*A(3, :).*A(1, :);
  A_E(6, 1:3) = 2*A(1, :).*A(2, :);

  % верхняя правая четверть
  A_E(1:3, 4) = A(:, 2).*A(:, 3);
  A_E(1:3, 5) = A(:, 3).*A(:, 1);
  A_E(1:3, 6) = A(:, 1).*A(:, 2);

  % нижняя правая четверть

  A_E(4,4) = A(2,2)*A(3,3) + A(2,3)*A(3,2);
  A_E(4,5) = A(2,3)*A(3,1) + A(2,1)*A(3,3);
  A_E(4,6) = A(2,1)*A(3,2) + A(2,2)*A(3,1);

  A_E(5,4) = A(1,2)*A(3,3) + A(1,3)*A(3,2);
  A_E(5,5) = A(1,3)*A(3,1) + A(1,1)*A(3,3);
  A_E(5,6) = A(1,1)*A(3,2) + A(1,2)*A(3,1);

  A_E(6,4) = A(1,2)*A(2,3) + A(1,3)*A(2,2);
  A_E(6,5) = A(1,3)*A(2,1) + A(1,1)*A(2,3);
  A_E(6,6) = A(1,1)*A(2,2) + A(1,2)*A(2,1);

  % коэффциенты матрицы s в повернутой СК
  smatrix_new = A_E*smatrix*A_T;
endfunction
